import React from "react";
import "./TeluguQuotes.css"; 

class TeluguQuotes extends React.Component {
  constructor() {
    super();
    this.state = {
        quote: "",
    };
  }
  handlequote = () => {
    let quotes= [
        "విజయానికి మూడు మెట్లు",
        "విజయం సాధించాలంటే కష్టపడాలి.",
        "అవకాశాలు ఎదురు చూస్తూ ఉండవు, వాటిని సృష్టించాలి.",
        "ప్రయత్నమే విజయానికి దారి.",
        "పొరపాట్లు నేర్పే పాఠాలు.",
        "ఆలోచనలే భవిష్యత్తును నిర్మిస్తాయి.",
        "నీవు నమ్మిన దానిని సాధించగలవు.",
        "నిన్నటి నష్టాలు, రేపటి విజయాలకు పునాది.",
        "ధైర్యమే నిజమైన బలం.",
        "సమయం విలువైనదని గుర్తించు.",
        "కష్టపడినవారే ఫలితాలు పొందుతారు.",
        "ప్రతి రోజు కొత్త అవకాశం.",
        "విజయం కంటే ప్రయాణమే గొప్పది.",
        "సాధించాలంటే మొదట నమ్మాలి.",
        "ఆలస్యం విజయానికి శత్రువు.",
        "సమస్యలతో భయపడకు, ఎదుర్కొను.",
        "నిరంతర శ్రమే విజయానికి మార్గం.",
        "తప్పిదాలు మనల్ని మానవులు చేస్తాయి.",
        "ఎవరికైనా మొదలు వుందే తప్ప ముగింపు లేదు.",
        "నిన్ను నువ్వు మించినప్పుడు నీవే విజేతవు.",
        "పరాజయాలు సాదారణం, కోల్పోకుండా ముందుకు సాగు.",
        "లక్ష్యం ఉన్నవారికి దారులు కనిపిస్తాయి.",
        "చెడు సమయం శాశ్వతం కాదు.",
        "మంచి ఆలోచనలే గొప్ప మార్పుల పునాది.",
        "మీ నమ్మకం మీ విజయాన్ని నిర్మిస్తుంది.",
        "ఆరంభం చిన్నదైనా ఆశయాలు పెద్దవిగా ఉంచు.",
        "ప్రతి రోజు మంచి పనే ప్రారంభించు.",
        "నీ కష్టమే నీ విజయానికి మార్గం.",
        "పనిలో ప్రేమ పెడితే ఫలితాలు గొప్పవే.",
        "ధైర్యంగా నడిచి విజయాన్ని చేరుకో.",
        "నేడు నీవు వేసే అడుగులు రేపటి విజయానికి బాటలు వేస్తాయి.",
      ]
    let randomIndex = Math.floor(Math.random() * quotes.length);
    this.setState({
        quote: quotes[randomIndex],
    });
  }
  render() {
    return (
        <div id="telugu-quotes">
            <h1>{this.state.quote}</h1>
            <button onClick={this.handlequote}>CLICK ME</button>
        </div>
    )
  }
}

export default TeluguQuotes;
